zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio3_uart0_cts */
#define GPIO3_UART0_CTS \
	BFLB_PINMUX(3, uart0, cts, periph)

/* gpio3_uart0_tx */
#define GPIO3_UART0_TX \
	BFLB_PINMUX(3, uart0, tx, periph)

/* gpio3_uart0_rx */
#define GPIO3_UART0_RX \
	BFLB_PINMUX(3, uart0, rx, periph)

/* gpio3_uart1_rts */
#define GPIO3_UART1_RTS \
	BFLB_PINMUX(3, uart1, rts, periph)

/* gpio3_uart1_cts */
#define GPIO3_UART1_CTS \
	BFLB_PINMUX(3, uart1, cts, periph)

/* gpio3_uart1_tx */
#define GPIO3_UART1_TX \
	BFLB_PINMUX(3, uart1, tx, periph)

/* gpio3_uart1_rx */
#define GPIO3_UART1_RX \
	BFLB_PINMUX(3, uart1, rx, periph)

/* gpio3_pwm_ch3 */
#define GPIO3_PWM_CH3 \
	BFLB_PINMUX(3, pwm, ch3, periph)

/* gpio3_cam_pix_dat0 */
#define GPIO3_CAM_PIX_DAT0 \
	BFLB_PINMUX(3, cam, pix_dat0, periph)

/* gpio3_jtag_tdo */
#define GPIO3_JTAG_TDO \
	BFLB_PINMUX(3, jtag, tdo, periph)

/* gpio3_fem_gpio3 */
#define GPIO3_FEM_GPIO3 \
	BFLB_PINMUX(3, fem, gpio3, periph)

/* gpio3_qdec1_a */
#define GPIO3_QDEC1_A \
	BFLB_PINMUX(3, qdec1, a, periph)

/* gpio4_clock_out0_i2s_ref */
#define GPIO4_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(4, clock_out0, i2s_ref, periph)

/* gpio4_clock_out0_aupll */
#define GPIO4_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(4, clock_out0, aupll, periph)

/* gpio4_clock_out0_xtal */
#define GPIO4_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(4, clock_out0, xtal, periph)

/* gpio4_i2s_bclk */
#define GPIO4_I2S_BCLK \
	BFLB_PINMUX(4, i2s, bclk, periph)

/* gpio4_spi_mosi */
#define GPIO4_SPI_MOSI \
	BFLB_PINMUX(4, spi, mosi, periph)

/* gpio4_i2c_scl */
#define GPIO4_I2C_SCL \
	BFLB_PINMUX(4, i2c, scl, periph)

/* gpio4_uart0_rts */
#define GPIO4_UART0_RTS \
	BFLB_PINMUX(4, uart0, rts, periph)

/* gpio4_uart0_cts */
#define GPIO4_UART0_CTS \
	BFLB_PINMUX(4, uart0, cts, periph)

/* gpio4_uart0_tx */
#define GPIO4_UART0_TX \
	BFLB_PINMUX(4, uart0, tx, periph)

/* gpio4_uart0_rx */
#define GPIO4_UART0_RX \
	BFLB_PINMUX(4, uart0, rx, periph)

/* gpio4_uart1_rts */
#define GPIO4_UART1_RTS \
	BFLB_PINMUX(4, uart1, rts, periph)

/* gpio4_uart1_cts */
#define GPIO4_UART1_CTS \
	BFLB_PINMUX(4, uart1, cts, periph)

/* gpio4_uart1_tx */
#define GPIO4_UART1_TX \
	BFLB_PINMUX(4, uart1, tx, periph)

/* gpio4_uart1_rx */
#define GPIO4_UART1_RX \
	BFLB_PINMUX(4, uart1, rx, periph)

/* gpio4_pwm_ch4 */
#define GPIO4_PWM_CH4 \
	BFLB_PINMUX(4, pwm, ch4, periph)

/* gpio4_cam_pix_dat1 */
#define GPIO4_CAM_PIX_DAT1 \
	BFLB_PINMUX(4, cam, pix_dat1, periph)

/* gpio4_jtag_tms */
#define GPIO4_JTAG_TMS \
	BFLB_PINMUX(4, jtag, tms, periph)

/* gpio4_fem_gpio4 */
#define GPIO4_FEM_GPIO4 \
	BFLB_PINMUX(4, fem, gpio4, periph)

/* gpio4_qdec1_b */
#define GPIO4_QDEC1_B \
	BFLB_PINMUX(4, qdec1, b, periph)

/* gpio5_clock_out1_i2s_ref */
#define GPIO5_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(5, clock_out1, i2s_ref, periph)

/* gpio5_clock_out1_aupll */
#define GPIO5_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(5, clock_out1, aupll, periph)

/* gpio5_clock_out1_xtal */
#define GPIO5_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(5, clock_out1, xtal, periph)

/* gpio5_i2s_fs */
#define GPIO5_I2S_FS \
	BFLB_PINMUX(5, i2s, fs, periph)

/* gpio5_spi_miso */
#define GPIO5_SPI_MISO \
	BFLB_PINMUX(5, spi, miso, periph)

/* gpio5_i2c_sda */
#define GPIO5_I2C_SDA \
	BFLB_PINMUX(5, i2c, sda, periph)

/* gpio5_uart0_rts */
#define GPIO5_UART0_RTS \
	BFLB_PINMUX(5, uart0, rts, periph)

/* gpio5_uart0_cts */
#define GPIO5_UART0_CTS \
	BFLB_PINMUX(5, uart0, cts, periph)

/* gpio5_uart0_tx */
#define GPIO5_UART0_TX \
	BFLB_PINMUX(5, uart0, tx, periph)

/* gpio5_uart0_rx */
#define GPIO5_UART0_RX \
	BFLB_PINMUX(5, uart0, rx, periph)

/* gpio5_uart1_rts */
#define GPIO5_UART1_RTS \
	BFLB_PINMUX(5, uart1, rts, periph)

/* gpio5_uart1_cts */
#define GPIO5_UART1_CTS \
	BFLB_PINMUX(5, uart1, cts, periph)

/* gpio5_uart1_tx */
#define GPIO5_UART1_TX \
	BFLB_PINMUX(5, uart1, tx, periph)

/* gpio5_uart1_rx */
#define GPIO5_UART1_RX \
	BFLB_PINMUX(5, uart1, rx, periph)

/* gpio5_pwm_ch0 */
#define GPIO5_PWM_CH0 \
	BFLB_PINMUX(5, pwm, ch0, periph)

/* gpio5_cam_pix_dat2 */
#define GPIO5_CAM_PIX_DAT2 \
	BFLB_PINMUX(5, cam, pix_dat2, periph)

/* gpio5_jtag_tdi */
#define GPIO5_JTAG_TDI \
	BFLB_PINMUX(5, jtag, tdi, periph)

/* gpio5_fem_gpio0 */
#define GPIO5_FEM_GPIO0 \
	BFLB_PINMUX(5, fem, gpio0, periph)

/* gpio5_qdec1_led */
#define GPIO5_QDEC1_LED \
	BFLB_PINMUX(5, qdec1, led, periph)

/* gpio6_clock_out0_i2s_ref */
#define GPIO6_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(6, clock_out0, i2s_ref, periph)

/* gpio6_clock_out0_aupll */
#define GPIO6_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(6, clock_out0, aupll, periph)

/* gpio6_clock_out0_xtal */
#define GPIO6_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(6, clock_out0, xtal, periph)

/* gpio6_i2s_do */
#define GPIO6_I2S_DO \
	BFLB_PINMUX(6, i2s, do, periph)

/* gpio6_spi_ss */
#define GPIO6_SPI_SS \
	BFLB_PINMUX(6, spi, ss, periph)

/* gpio6_i2c_scl */
#define GPIO6_I2C_SCL \
	BFLB_PINMUX(6, i2c, scl, periph)

/* gpio6_uart0_rts */
#define GPIO6_UART0_RTS \
	BFLB_PINMUX(6, uart0, rts, periph)

/* gpio6_uart0_cts */
#define GPIO6_UART0_CTS \
	BFLB_PINMUX(6, uart0, cts, periph)

/* gpio6_uart0_tx */
#define GPIO6_UART0_TX \
	BFLB_PINMUX(6, uart0, tx, periph)

/* gpio6_uart0_rx */
#define GPIO6_UART0_RX \
	BFLB_PINMUX(6, uart0, rx, periph)

/* gpio6_uart1_rts */
#define GPIO6_UART1_RTS \
	BFLB_PINMUX(6, uart1, rts, periph)

/* gpio6_uart1_cts */
#define GPIO6_UART1_CTS \
	BFLB_PINMUX(6, uart1, cts, periph)

/* gpio6_uart1_tx */
#define GPIO6_UART1_TX \
	BFLB_PINMUX(6, uart1, tx, periph)

/* gpio6_uart1_rx */
#define GPIO6_UART1_RX \
	BFLB_PINMUX(6, uart1, rx, periph)

/* gpio6_pwm_ch1 */
#define GPIO6_PWM_CH1 \
	BFLB_PINMUX(6, pwm, ch1, periph)

/* gpio6_cam_pix_dat3 */
#define GPIO6_CAM_PIX_DAT3 \
	BFLB_PINMUX(6, cam, pix_dat3, periph)

/* gpio6_jtag_tck */
#define GPIO6_JTAG_TCK \
	BFLB_PINMUX(6, jtag, tck, periph)

/* gpio6_fem_gpio1 */
#define GPIO6_FEM_GPIO1 \
	BFLB_PINMUX(6, fem, gpio1, periph)

/* gpio6_qdec2_a */
#define GPIO6_QDEC2_A \
	BFLB_PINMUX(6, qdec2, a, periph)

/* gpio7_clock_out1_i2s_ref */
#define GPIO7_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(7, clock_out1, i2s_ref, periph)

