zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio10_uart1_rts */
#define GPIO10_UART1_RTS \
	BFLB_PINMUX(10, uart1, rts, periph)

/* gpio10_uart1_cts */
#define GPIO10_UART1_CTS \
	BFLB_PINMUX(10, uart1, cts, periph)

/* gpio10_uart1_tx */
#define GPIO10_UART1_TX \
	BFLB_PINMUX(10, uart1, tx, periph)

/* gpio10_uart1_rx */
#define GPIO10_UART1_RX \
	BFLB_PINMUX(10, uart1, rx, periph)

/* gpio10_pwm_ch0 */
#define GPIO10_PWM_CH0 \
	BFLB_PINMUX(10, pwm, ch0, periph)

/* gpio10_jtag_tck */
#define GPIO10_JTAG_TCK \
	BFLB_PINMUX(10, jtag, tck, periph)

/* gpio10_fem_gpio0 */
#define GPIO10_FEM_GPIO0 \
	BFLB_PINMUX(10, fem, gpio0, periph)

/* gpio10_qdec0_b */
#define GPIO10_QDEC0_B \
	BFLB_PINMUX(10, qdec0, b, periph)

/* gpio10_mic_bias */
#define GPIO10_MIC_BIAS \
	BFLB_PINMUX(10, mic, bias, analog)

/* gpio11_clock_out1_i2s_ref */
#define GPIO11_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(11, clock_out1, i2s_ref, periph)

/* gpio11_clock_out1_aupll */
#define GPIO11_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(11, clock_out1, aupll, periph)

/* gpio11_clock_out1_xtal */
#define GPIO11_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(11, clock_out1, xtal, periph)

/* gpio11_i2s_di */
#define GPIO11_I2S_DI \
	BFLB_PINMUX(11, i2s, di, periph)

/* gpio11_spi_sclk */
#define GPIO11_SPI_SCLK \
	BFLB_PINMUX(11, spi, sclk, periph)

/* gpio11_i2c_sda */
#define GPIO11_I2C_SDA \
	BFLB_PINMUX(11, i2c, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_uart1_rts */
#define GPIO11_UART1_RTS \
	BFLB_PINMUX(11, uart1, rts, periph)

/* gpio11_uart1_cts */
#define GPIO11_UART1_CTS \
	BFLB_PINMUX(11, uart1, cts, periph)

/* gpio11_uart1_tx */
#define GPIO11_UART1_TX \
	BFLB_PINMUX(11, uart1, tx, periph)

/* gpio11_uart1_rx */
#define GPIO11_UART1_RX \
	BFLB_PINMUX(11, uart1, rx, periph)

/* gpio11_pwm_ch1 */
#define GPIO11_PWM_CH1 \
	BFLB_PINMUX(11, pwm, ch1, periph)

/* gpio11_jtag_tdo */
#define GPIO11_JTAG_TDO \
	BFLB_PINMUX(11, jtag, tdo, periph)

/* gpio11_fem_gpio1 */
#define GPIO11_FEM_GPIO1 \
	BFLB_PINMUX(11, fem, gpio1, periph)

/* gpio11_qdec0_led */
#define GPIO11_QDEC0_LED \
	BFLB_PINMUX(11, qdec0, led, periph)

/* gpio11_adc_ch3 */
#define GPIO11_ADC_CH3 \
	BFLB_PINMUX(11, adc, ch3, analog)

/* gpio11_dac_cha */
#define GPIO11_DAC_CHA \
	BFLB_PINMUX(11, dac, cha, analog)

/* gpio12_clock_out0_i2s_ref */
#define GPIO12_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(12, clock_out0, i2s_ref, periph)

/* gpio12_clock_out0_aupll */
#define GPIO12_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(12, clock_out0, aupll, periph)

/* gpio12_clock_out0_xtal */
#define GPIO12_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(12, clock_out0, xtal, periph)

/* gpio12_i2s_bclk */
#define GPIO12_I2S_BCLK \
	BFLB_PINMUX(12, i2s, bclk, periph)

/* gpio12_spi_mosi */
#define GPIO12_SPI_MOSI \
	BFLB_PINMUX(12, spi, mosi, periph)

/* gpio12_i2c_scl */
#define GPIO12_I2C_SCL \
	BFLB_PINMUX(12, i2c, scl, periph)

/* gpio12_uart0_rts */
#define GPIO12_UART0_RTS \
	BFLB_PINMUX(12, uart0, rts, periph)

/* gpio12_uart0_cts */
#define GPIO12_UART0_CTS \
	BFLB_PINMUX(12, uart0, cts, periph)

/* gpio12_uart0_tx */
#define GPIO12_UART0_TX \
	BFLB_PINMUX(12, uart0, tx, periph)

/* gpio12_uart0_rx */
#define GPIO12_UART0_RX \
	BFLB_PINMUX(12, uart0, rx, periph)

/* gpio12_uart1_rts */
#define GPIO12_UART1_RTS \
	BFLB_PINMUX(12, uart1, rts, periph)

/* gpio12_uart1_cts */
#define GPIO12_UART1_CTS \
	BFLB_PINMUX(12, uart1, cts, periph)

/* gpio12_uart1_tx */
#define GPIO12_UART1_TX \
	BFLB_PINMUX(12, uart1, tx, periph)

/* gpio12_uart1_rx */
#define GPIO12_UART1_RX \
	BFLB_PINMUX(12, uart1, rx, periph)

/* gpio12_pwm_ch2 */
#define GPIO12_PWM_CH2 \
	BFLB_PINMUX(12, pwm, ch2, periph)

/* gpio12_cam_pix_dat4 */
#define GPIO12_CAM_PIX_DAT4 \
	BFLB_PINMUX(12, cam, pix_dat4, periph)

/* gpio12_jtag_tms */
#define GPIO12_JTAG_TMS \
	BFLB_PINMUX(12, jtag, tms, periph)

/* gpio12_fem_gpio2 */
#define GPIO12_FEM_GPIO2 \
	BFLB_PINMUX(12, fem, gpio2, periph)

/* gpio12_qdec1_a */
#define GPIO12_QDEC1_A \
	BFLB_PINMUX(12, qdec1, a, periph)

/* gpio12_adc_ch4 */
#define GPIO12_ADC_CH4 \
	BFLB_PINMUX(12, adc, ch4, analog)

/* gpio14_clock_out0_i2s_ref */
#define GPIO14_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(14, clock_out0, i2s_ref, periph)

/* gpio14_clock_out0_aupll */
#define GPIO14_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(14, clock_out0, aupll, periph)

/* gpio14_clock_out0_xtal */
#define GPIO14_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(14, clock_out0, xtal, periph)

/* gpio14_i2s_do */
#define GPIO14_I2S_DO \
	BFLB_PINMUX(14, i2s, do, periph)

/* gpio14_spi_ss */
#define GPIO14_SPI_SS \
	BFLB_PINMUX(14, spi, ss, periph)

/* gpio14_i2c_scl */
#define GPIO14_I2C_SCL \
	BFLB_PINMUX(14, i2c, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_uart1_rts */
#define GPIO14_UART1_RTS \
	BFLB_PINMUX(14, uart1, rts, periph)

/* gpio14_uart1_cts */
#define GPIO14_UART1_CTS \
	BFLB_PINMUX(14, uart1, cts, periph)

/* gpio14_uart1_tx */
#define GPIO14_UART1_TX \
	BFLB_PINMUX(14, uart1, tx, periph)

/* gpio14_uart1_rx */
#define GPIO14_UART1_RX \
	BFLB_PINMUX(14, uart1, rx, periph)

/* gpio14_pwm_ch4 */
#define GPIO14_PWM_CH4 \
	BFLB_PINMUX(14, pwm, ch4, periph)

/* gpio14_jtag_tck */
#define GPIO14_JTAG_TCK \
	BFLB_PINMUX(14, jtag, tck, periph)

/* gpio14_fem_gpio4 */
#define GPIO14_FEM_GPIO4 \
	BFLB_PINMUX(14, fem, gpio4, periph)

/* gpio14_qdec1_led */
#define GPIO14_QDEC1_LED \
	BFLB_PINMUX(14, qdec1, led, periph)

/* gpio14_adc_ch5 */
#define GPIO14_ADC_CH5 \
	BFLB_PINMUX(14, adc, ch5, analog)

/* gpio14_atest_out0 */
#define GPIO14_ATEST_OUT0 \
	BFLB_PINMUX(14, atest, out0, analog)

/* gpio15_clock_out1_i2s_ref */
#define GPIO15_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(15, clock_out1, i2s_ref, periph)

