zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio15_clock_out1_aupll */
#define GPIO15_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(15, clock_out1, aupll, periph)

/* gpio15_clock_out1_xtal */
#define GPIO15_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(15, clock_out1, xtal, periph)

/* gpio15_i2s_di */
#define GPIO15_I2S_DI \
	BFLB_PINMUX(15, i2s, di, periph)

/* gpio15_spi_sclk */
#define GPIO15_SPI_SCLK \
	BFLB_PINMUX(15, spi, sclk, periph)

/* gpio15_i2c_sda */
#define GPIO15_I2C_SDA \
	BFLB_PINMUX(15, i2c, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_uart1_rts */
#define GPIO15_UART1_RTS \
	BFLB_PINMUX(15, uart1, rts, periph)

/* gpio15_uart1_cts */
#define GPIO15_UART1_CTS \
	BFLB_PINMUX(15, uart1, cts, periph)

/* gpio15_uart1_tx */
#define GPIO15_UART1_TX \
	BFLB_PINMUX(15, uart1, tx, periph)

/* gpio15_uart1_rx */
#define GPIO15_UART1_RX \
	BFLB_PINMUX(15, uart1, rx, periph)

/* gpio15_pwm_ch0 */
#define GPIO15_PWM_CH0 \
	BFLB_PINMUX(15, pwm, ch0, periph)

/* gpio15_jtag_tdo */
#define GPIO15_JTAG_TDO \
	BFLB_PINMUX(15, jtag, tdo, periph)

/* gpio15_fem_gpio0 */
#define GPIO15_FEM_GPIO0 \
	BFLB_PINMUX(15, fem, gpio0, periph)

/* gpio15_qdec2_a */
#define GPIO15_QDEC2_A \
	BFLB_PINMUX(15, qdec2, a, periph)

/* gpio15_adc_ch1 */
#define GPIO15_ADC_CH1 \
	BFLB_PINMUX(15, adc, ch1, analog)

/* gpio15_atest_out1 */
#define GPIO15_ATEST_OUT1 \
	BFLB_PINMUX(15, atest, out1, analog)

/* gpio16_clock_out0_i2s_ref */
#define GPIO16_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(16, clock_out0, i2s_ref, periph)

/* gpio16_clock_out0_aupll */
#define GPIO16_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(16, clock_out0, aupll, periph)

/* gpio16_clock_out0_xtal */
#define GPIO16_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(16, clock_out0, xtal, periph)

/* gpio16_i2s_blck */
#define GPIO16_I2S_BLCK \
	BFLB_PINMUX(16, i2s, blck, periph)

/* gpio16_spi_mosi */
#define GPIO16_SPI_MOSI \
	BFLB_PINMUX(16, spi, mosi, periph)

/* gpio16_i2c_scl */
#define GPIO16_I2C_SCL \
	BFLB_PINMUX(16, i2c, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_uart1_rts */
#define GPIO16_UART1_RTS \
	BFLB_PINMUX(16, uart1, rts, periph)

/* gpio16_uart1_cts */
#define GPIO16_UART1_CTS \
	BFLB_PINMUX(16, uart1, cts, periph)

/* gpio16_uart1_tx */
#define GPIO16_UART1_TX \
	BFLB_PINMUX(16, uart1, tx, periph)

/* gpio16_uart1_rx */
#define GPIO16_UART1_RX \
	BFLB_PINMUX(16, uart1, rx, periph)

/* gpio16_pwm_ch1 */
#define GPIO16_PWM_CH1 \
	BFLB_PINMUX(16, pwm, ch1, periph)

/* gpio16_jtag_tms */
#define GPIO16_JTAG_TMS \
	BFLB_PINMUX(16, jtag, tms, periph)

/* gpio16_fem_gpio1 */
#define GPIO16_FEM_GPIO1 \
	BFLB_PINMUX(16, fem, gpio1, periph)

/* gpio16_qdec2_b */
#define GPIO16_QDEC2_B \
	BFLB_PINMUX(16, qdec2, b, periph)

/* gpio17_clock_out1_i2s_ref */
#define GPIO17_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(17, clock_out1, i2s_ref, periph)

/* gpio17_clock_out1_aupll */
#define GPIO17_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(17, clock_out1, aupll, periph)

/* gpio17_clock_out1_xtal */
#define GPIO17_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(17, clock_out1, xtal, periph)

/* gpio17_sf1_d0 */
#define GPIO17_SF1_D0 \
	BFLB_PINMUX(17, sf1, d0, periph)

/* gpio17_sf2_cs2 */
#define GPIO17_SF2_CS2 \
	BFLB_PINMUX(17, sf2, cs2, periph)

/* gpio17_i2s_fs */
#define GPIO17_I2S_FS \
	BFLB_PINMUX(17, i2s, fs, periph)

/* gpio17_spi_miso */
#define GPIO17_SPI_MISO \
	BFLB_PINMUX(17, spi, miso, periph)

/* gpio17_i2c_sda */
#define GPIO17_I2C_SDA \
	BFLB_PINMUX(17, i2c, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_uart1_rts */
#define GPIO17_UART1_RTS \
	BFLB_PINMUX(17, uart1, rts, periph)

/* gpio17_uart1_cts */
#define GPIO17_UART1_CTS \
	BFLB_PINMUX(17, uart1, cts, periph)

/* gpio17_uart1_tx */
#define GPIO17_UART1_TX \
	BFLB_PINMUX(17, uart1, tx, periph)

/* gpio17_uart1_rx */
#define GPIO17_UART1_RX \
	BFLB_PINMUX(17, uart1, rx, periph)

/* gpio17_pwm_ch2 */
#define GPIO17_PWM_CH2 \
	BFLB_PINMUX(17, pwm, ch2, periph)

/* gpio17_jtag_tdi */
#define GPIO17_JTAG_TDI \
	BFLB_PINMUX(17, jtag, tdi, periph)

/* gpio17_fem_gpio2 */
#define GPIO17_FEM_GPIO2 \
	BFLB_PINMUX(17, fem, gpio2, periph)

/* gpio17_qdec2_led */
#define GPIO17_QDEC2_LED \
	BFLB_PINMUX(17, qdec2, led, periph)

/* gpio17_adc_ch2 */
#define GPIO17_ADC_CH2 \
	BFLB_PINMUX(17, adc, ch2, analog)

/* gpio17_dac_chb */
#define GPIO17_DAC_CHB \
	BFLB_PINMUX(17, dac, chb, analog)

/* gpio18_clock_out0_i2s_ref */
#define GPIO18_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(18, clock_out0, i2s_ref, periph)

/* gpio18_clock_out0_aupll */
#define GPIO18_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(18, clock_out0, aupll, periph)

/* gpio18_clock_out0_xtal */
#define GPIO18_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(18, clock_out0, xtal, periph)

/* gpio18_sf1_d1 */
#define GPIO18_SF1_D1 \
	BFLB_PINMUX(18, sf1, d1, periph)

/* gpio18_i2s_do */
#define GPIO18_I2S_DO \
	BFLB_PINMUX(18, i2s, do, periph)

/* gpio18_spi_ss */
#define GPIO18_SPI_SS \
	BFLB_PINMUX(18, spi, ss, periph)

/* gpio18_i2c_scl */
#define GPIO18_I2C_SCL \
	BFLB_PINMUX(18, i2c, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_uart1_rts */
#define GPIO18_UART1_RTS \
	BFLB_PINMUX(18, uart1, rts, periph)

