zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio21_pwm_ch1 */
#define GPIO21_PWM_CH1 \
	BFLB_PINMUX(21, pwm, ch1, periph)

/* gpio21_jtag_tdi */
#define GPIO21_JTAG_TDI \
	BFLB_PINMUX(21, jtag, tdi, periph)

/* gpio21_fem_gpio1 */
#define GPIO21_FEM_GPIO1 \
	BFLB_PINMUX(21, fem, gpio1, periph)

/* gpio21_mii_tx_en */
#define GPIO21_MII_TX_EN \
	BFLB_PINMUX(21, mii, tx_en, periph)

/* gpio21_qdec1_led */
#define GPIO21_QDEC1_LED \
	BFLB_PINMUX(21, qdec1, led, periph)

/* gpio21_adc_ch11 */
#define GPIO21_ADC_CH11 \
	BFLB_PINMUX(21, adc, ch11, analog)

/* gpio22_clock_out0_i2s_ref */
#define GPIO22_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(22, clock_out0, i2s_ref, periph)

/* gpio22_clock_out0_aupll */
#define GPIO22_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(22, clock_out0, aupll, periph)

/* gpio22_clock_out0_xtal */
#define GPIO22_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(22, clock_out0, xtal, periph)

/* gpio22_sf1_d2 */
#define GPIO22_SF1_D2 \
	BFLB_PINMUX(22, sf1, d2, periph)

/* gpio22_i2s_do */
#define GPIO22_I2S_DO \
	BFLB_PINMUX(22, i2s, do, periph)

/* gpio22_spi_ss */
#define GPIO22_SPI_SS \
	BFLB_PINMUX(22, spi, ss, periph)

/* gpio22_i2c_scl */
#define GPIO22_I2C_SCL \
	BFLB_PINMUX(22, i2c, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_uart1_rts */
#define GPIO22_UART1_RTS \
	BFLB_PINMUX(22, uart1, rts, periph)

/* gpio22_uart1_cts */
#define GPIO22_UART1_CTS \
	BFLB_PINMUX(22, uart1, cts, periph)

/* gpio22_uart1_tx */
#define GPIO22_UART1_TX \
	BFLB_PINMUX(22, uart1, tx, periph)

/* gpio22_uart1_rx */
#define GPIO22_UART1_RX \
	BFLB_PINMUX(22, uart1, rx, periph)

/* gpio22_pwm_ch2 */
#define GPIO22_PWM_CH2 \
	BFLB_PINMUX(22, pwm, ch2, periph)

/* gpio22_jtag_tck */
#define GPIO22_JTAG_TCK \
	BFLB_PINMUX(22, jtag, tck, periph)

/* gpio22_fem_gpio2 */
#define GPIO22_FEM_GPIO2 \
	BFLB_PINMUX(22, fem, gpio2, periph)

/* gpio22_mii_rx_dv */
#define GPIO22_MII_RX_DV \
	BFLB_PINMUX(22, mii, rx_dv, periph)

/* gpio22_qdec1_b */
#define GPIO22_QDEC1_B \
	BFLB_PINMUX(22, qdec1, b, periph)

/* gpio22_ir_tx */
#define GPIO22_IR_TX \
	BFLB_PINMUX(22, ir, tx, analog)

/* gpio23_clock_out1_i2s_ref */
#define GPIO23_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(23, clock_out1, i2s_ref, periph)

/* gpio23_clock_out1_aupll */
#define GPIO23_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(23, clock_out1, aupll, periph)

/* gpio23_clock_out1_xtal */
#define GPIO23_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(23, clock_out1, xtal, periph)

/* gpio23_sf2_d2 */
#define GPIO23_SF2_D2 \
	BFLB_PINMUX(23, sf2, d2, periph)

/* gpio23_sf2_cs */
#define GPIO23_SF2_CS \
	BFLB_PINMUX(23, sf2, cs, periph)

/* gpio23_sf3_cs2 */
#define GPIO23_SF3_CS2 \
	BFLB_PINMUX(23, sf3, cs2, periph)

/* gpio23_i2s_di */
#define GPIO23_I2S_DI \
	BFLB_PINMUX(23, i2s, di, periph)

/* gpio23_spi_sclk */
#define GPIO23_SPI_SCLK \
	BFLB_PINMUX(23, spi, sclk, periph)

/* gpio23_i2c_sda */
#define GPIO23_I2C_SDA \
	BFLB_PINMUX(23, i2c, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_uart1_rts */
#define GPIO23_UART1_RTS \
	BFLB_PINMUX(23, uart1, rts, periph)

/* gpio23_uart1_cts */
#define GPIO23_UART1_CTS \
	BFLB_PINMUX(23, uart1, cts, periph)

/* gpio23_uart1_tx */
#define GPIO23_UART1_TX \
	BFLB_PINMUX(23, uart1, tx, periph)

/* gpio23_uart1_rx */
#define GPIO23_UART1_RX \
	BFLB_PINMUX(23, uart1, rx, periph)

/* gpio23_pwm_ch3 */
#define GPIO23_PWM_CH3 \
	BFLB_PINMUX(23, pwm, ch3, periph)

/* gpio23_cam_pix_dat4 */
#define GPIO23_CAM_PIX_DAT4 \
	BFLB_PINMUX(23, cam, pix_dat4, periph)

/* gpio23_jtag_tdo */
#define GPIO23_JTAG_TDO \
	BFLB_PINMUX(23, jtag, tdo, periph)

/* gpio23_fem_gpio3 */
#define GPIO23_FEM_GPIO3 \
	BFLB_PINMUX(23, fem, gpio3, periph)

/* gpio23_qdec1_led */
#define GPIO23_QDEC1_LED \
	BFLB_PINMUX(23, qdec1, led, periph)

/* gpio23_ir_tx */
#define GPIO23_IR_TX \
	BFLB_PINMUX(23, ir, tx, analog)

/* gpio24_clock_out0_i2s_ref */
#define GPIO24_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(24, clock_out0, i2s_ref, periph)

/* gpio24_clock_out0_aupll */
#define GPIO24_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(24, clock_out0, aupll, periph)

/* gpio24_clock_out0_xtal */
#define GPIO24_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(24, clock_out0, xtal, periph)

/* gpio24_sf2_d1 */
#define GPIO24_SF2_D1 \
	BFLB_PINMUX(24, sf2, d1, periph)

/* gpio24_i2s_blck */
#define GPIO24_I2S_BLCK \
	BFLB_PINMUX(24, i2s, blck, periph)

/* gpio24_spi_mosi */
#define GPIO24_SPI_MOSI \
	BFLB_PINMUX(24, spi, mosi, periph)

/* gpio24_i2c_scl */
#define GPIO24_I2C_SCL \
	BFLB_PINMUX(24, i2c, scl, periph)

/* gpio24_uart0_rts */
#define GPIO24_UART0_RTS \
	BFLB_PINMUX(24, uart0, rts, periph)

/* gpio24_uart0_cts */
#define GPIO24_UART0_CTS \
	BFLB_PINMUX(24, uart0, cts, periph)

/* gpio24_uart0_tx */
#define GPIO24_UART0_TX \
	BFLB_PINMUX(24, uart0, tx, periph)

/* gpio24_uart0_rx */
#define GPIO24_UART0_RX \
	BFLB_PINMUX(24, uart0, rx, periph)

/* gpio24_uart1_rts */
#define GPIO24_UART1_RTS \
	BFLB_PINMUX(24, uart1, rts, periph)

/* gpio24_uart1_cts */
#define GPIO24_UART1_CTS \
	BFLB_PINMUX(24, uart1, cts, periph)

/* gpio24_uart1_tx */
#define GPIO24_UART1_TX \
	BFLB_PINMUX(24, uart1, tx, periph)

/* gpio24_uart1_rx */
#define GPIO24_UART1_RX \
	BFLB_PINMUX(24, uart1, rx, periph)

/* gpio24_pwm_ch4 */
#define GPIO24_PWM_CH4 \
	BFLB_PINMUX(24, pwm, ch4, periph)

/* gpio24_cam_pix_dat5 */
#define GPIO24_CAM_PIX_DAT5 \
	BFLB_PINMUX(24, cam, pix_dat5, periph)

/* gpio24_jtag_tms */
#define GPIO24_JTAG_TMS \
	BFLB_PINMUX(24, jtag, tms, periph)

/* gpio24_fem_gpio4 */
#define GPIO24_FEM_GPIO4 \
	BFLB_PINMUX(24, fem, gpio4, periph)

/* gpio24_mii_mdc */
#define GPIO24_MII_MDC \
	BFLB_PINMUX(24, mii, mdc, periph)

/* gpio24_qdec2_a */
#define GPIO24_QDEC2_A \
	BFLB_PINMUX(24, qdec2, a, periph)

/* gpio25_clock_out1_i2s_ref */
#define GPIO25_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(25, clock_out1, i2s_ref, periph)

