zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio25_clock_out1_aupll */
#define GPIO25_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(25, clock_out1, aupll, periph)

/* gpio25_clock_out1_xtal */
#define GPIO25_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(25, clock_out1, xtal, periph)

/* gpio25_sf2_cs */
#define GPIO25_SF2_CS \
	BFLB_PINMUX(25, sf2, cs, periph)

/* gpio25_sf2_d2 */
#define GPIO25_SF2_D2 \
	BFLB_PINMUX(25, sf2, d2, periph)

/* gpio25_i2s_fs */
#define GPIO25_I2S_FS \
	BFLB_PINMUX(25, i2s, fs, periph)

/* gpio25_spi_miso */
#define GPIO25_SPI_MISO \
	BFLB_PINMUX(25, spi, miso, periph)

/* gpio25_i2c_sda */
#define GPIO25_I2C_SDA \
	BFLB_PINMUX(25, i2c, sda, periph)

/* gpio25_uart0_rts */
#define GPIO25_UART0_RTS \
	BFLB_PINMUX(25, uart0, rts, periph)

/* gpio25_uart0_cts */
#define GPIO25_UART0_CTS \
	BFLB_PINMUX(25, uart0, cts, periph)

/* gpio25_uart0_tx */
#define GPIO25_UART0_TX \
	BFLB_PINMUX(25, uart0, tx, periph)

/* gpio25_uart0_rx */
#define GPIO25_UART0_RX \
	BFLB_PINMUX(25, uart0, rx, periph)

/* gpio25_uart1_rts */
#define GPIO25_UART1_RTS \
	BFLB_PINMUX(25, uart1, rts, periph)

/* gpio25_uart1_cts */
#define GPIO25_UART1_CTS \
	BFLB_PINMUX(25, uart1, cts, periph)

/* gpio25_uart1_tx */
#define GPIO25_UART1_TX \
	BFLB_PINMUX(25, uart1, tx, periph)

/* gpio25_uart1_rx */
#define GPIO25_UART1_RX \
	BFLB_PINMUX(25, uart1, rx, periph)

/* gpio25_pwm_ch0 */
#define GPIO25_PWM_CH0 \
	BFLB_PINMUX(25, pwm, ch0, periph)

/* gpio25_cam_pix_dat6 */
#define GPIO25_CAM_PIX_DAT6 \
	BFLB_PINMUX(25, cam, pix_dat6, periph)

/* gpio25_jtag_tdi */
#define GPIO25_JTAG_TDI \
	BFLB_PINMUX(25, jtag, tdi, periph)

/* gpio25_fem_gpio0 */
#define GPIO25_FEM_GPIO0 \
	BFLB_PINMUX(25, fem, gpio0, periph)

/* gpio25_mii_mdio */
#define GPIO25_MII_MDIO \
	BFLB_PINMUX(25, mii, mdio, periph)

/* gpio25_qdec2_b */
#define GPIO25_QDEC2_B \
	BFLB_PINMUX(25, qdec2, b, periph)

/* gpio26_clock_out0_i2s_ref */
#define GPIO26_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(26, clock_out0, i2s_ref, periph)

/* gpio26_clock_out0_aupll */
#define GPIO26_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(26, clock_out0, aupll, periph)

/* gpio26_clock_out0_xtal */
#define GPIO26_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(26, clock_out0, xtal, periph)

/* gpio26_sf2_d3 */
#define GPIO26_SF2_D3 \
	BFLB_PINMUX(26, sf2, d3, periph)

/* gpio26_sf2_d0 */
#define GPIO26_SF2_D0 \
	BFLB_PINMUX(26, sf2, d0, periph)

/* gpio26_i2s_do */
#define GPIO26_I2S_DO \
	BFLB_PINMUX(26, i2s, do, periph)

/* gpio26_spi_ss */
#define GPIO26_SPI_SS \
	BFLB_PINMUX(26, spi, ss, periph)

/* gpio26_i2c_scl */
#define GPIO26_I2C_SCL \
	BFLB_PINMUX(26, i2c, scl, periph)

/* gpio26_uart0_rts */
#define GPIO26_UART0_RTS \
	BFLB_PINMUX(26, uart0, rts, periph)

/* gpio26_uart0_cts */
#define GPIO26_UART0_CTS \
	BFLB_PINMUX(26, uart0, cts, periph)

/* gpio26_uart0_tx */
#define GPIO26_UART0_TX \
	BFLB_PINMUX(26, uart0, tx, periph)

/* gpio26_uart0_rx */
#define GPIO26_UART0_RX \
	BFLB_PINMUX(26, uart0, rx, periph)

/* gpio26_uart1_rts */
#define GPIO26_UART1_RTS \
	BFLB_PINMUX(26, uart1, rts, periph)

/* gpio26_uart1_cts */
#define GPIO26_UART1_CTS \
	BFLB_PINMUX(26, uart1, cts, periph)

/* gpio26_uart1_tx */
#define GPIO26_UART1_TX \
	BFLB_PINMUX(26, uart1, tx, periph)

/* gpio26_uart1_rx */
#define GPIO26_UART1_RX \
	BFLB_PINMUX(26, uart1, rx, periph)

/* gpio26_pwm_ch1 */
#define GPIO26_PWM_CH1 \
	BFLB_PINMUX(26, pwm, ch1, periph)

/* gpio26_cam_pix_dat7 */
#define GPIO26_CAM_PIX_DAT7 \
	BFLB_PINMUX(26, cam, pix_dat7, periph)

/* gpio26_jtag_tck */
#define GPIO26_JTAG_TCK \
	BFLB_PINMUX(26, jtag, tck, periph)

/* gpio26_fem_gpio1 */
#define GPIO26_FEM_GPIO1 \
	BFLB_PINMUX(26, fem, gpio1, periph)

/* gpio26_mii_rxerr */
#define GPIO26_MII_RXERR \
	BFLB_PINMUX(26, mii, rxerr, periph)

/* gpio26_qdec2_led */
#define GPIO26_QDEC2_LED \
	BFLB_PINMUX(26, qdec2, led, periph)

/* gpio27_clock_out1_i2s_ref */
#define GPIO27_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(27, clock_out1, i2s_ref, periph)

/* gpio27_clock_out1_aupll */
#define GPIO27_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(27, clock_out1, aupll, periph)

/* gpio27_clock_out1_xtal */
#define GPIO27_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(27, clock_out1, xtal, periph)

/* gpio27_sf2_clk */
#define GPIO27_SF2_CLK \
	BFLB_PINMUX(27, sf2, clk, periph)

/* gpio27_i2s_di */
#define GPIO27_I2S_DI \
	BFLB_PINMUX(27, i2s, di, periph)

/* gpio27_spi_sclk */
#define GPIO27_SPI_SCLK \
	BFLB_PINMUX(27, spi, sclk, periph)

/* gpio27_i2c_sda */
#define GPIO27_I2C_SDA \
	BFLB_PINMUX(27, i2c, sda, periph)

/* gpio27_uart0_rts */
#define GPIO27_UART0_RTS \
	BFLB_PINMUX(27, uart0, rts, periph)

/* gpio27_uart0_cts */
#define GPIO27_UART0_CTS \
	BFLB_PINMUX(27, uart0, cts, periph)

/* gpio27_uart0_tx */
#define GPIO27_UART0_TX \
	BFLB_PINMUX(27, uart0, tx, periph)

/* gpio27_uart0_rx */
#define GPIO27_UART0_RX \
	BFLB_PINMUX(27, uart0, rx, periph)

/* gpio27_uart1_rts */
#define GPIO27_UART1_RTS \
	BFLB_PINMUX(27, uart1, rts, periph)

/* gpio27_uart1_cts */
#define GPIO27_UART1_CTS \
	BFLB_PINMUX(27, uart1, cts, periph)

/* gpio27_uart1_tx */
#define GPIO27_UART1_TX \
	BFLB_PINMUX(27, uart1, tx, periph)

/* gpio27_uart1_rx */
#define GPIO27_UART1_RX \
	BFLB_PINMUX(27, uart1, rx, periph)

/* gpio27_pwm_ch2 */
#define GPIO27_PWM_CH2 \
	BFLB_PINMUX(27, pwm, ch2, periph)

/* gpio27_jtag_tdo */
#define GPIO27_JTAG_TDO \
	BFLB_PINMUX(27, jtag, tdo, periph)

/* gpio27_fem_gpio2 */
#define GPIO27_FEM_GPIO2 \
	BFLB_PINMUX(27, fem, gpio2, periph)

/* gpio27_mii_tx_en */
#define GPIO27_MII_TX_EN \
	BFLB_PINMUX(27, mii, tx_en, periph)

/* gpio27_qdec0_a */
#define GPIO27_QDEC0_A \
	BFLB_PINMUX(27, qdec0, a, periph)

/* gpio28_clock_out0_i2s_ref */
#define GPIO28_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(28, clock_out0, i2s_ref, periph)

/* gpio28_clock_out0_aupll */
#define GPIO28_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(28, clock_out0, aupll, periph)

/* gpio28_clock_out0_xtal */
#define GPIO28_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(28, clock_out0, xtal, periph)

/* gpio28_sf2_d0 */
#define GPIO28_SF2_D0 \
	BFLB_PINMUX(28, sf2, d0, periph)

/* gpio28_sf2_d3 */
#define GPIO28_SF2_D3 \
	BFLB_PINMUX(28, sf2, d3, periph)

/* gpio28_i2s_bclk */
#define GPIO28_I2S_BCLK \
	BFLB_PINMUX(28, i2s, bclk, periph)

