zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl706x-pinctrl.h
/* gpio28_spi_mosi */
#define GPIO28_SPI_MOSI \
	BFLB_PINMUX(28, spi, mosi, periph)

/* gpio28_i2c_scl */
#define GPIO28_I2C_SCL \
	BFLB_PINMUX(28, i2c, scl, periph)

/* gpio28_uart0_rts */
#define GPIO28_UART0_RTS \
	BFLB_PINMUX(28, uart0, rts, periph)

/* gpio28_uart0_cts */
#define GPIO28_UART0_CTS \
	BFLB_PINMUX(28, uart0, cts, periph)

/* gpio28_uart0_tx */
#define GPIO28_UART0_TX \
	BFLB_PINMUX(28, uart0, tx, periph)

/* gpio28_uart0_rx */
#define GPIO28_UART0_RX \
	BFLB_PINMUX(28, uart0, rx, periph)

/* gpio28_uart1_rts */
#define GPIO28_UART1_RTS \
	BFLB_PINMUX(28, uart1, rts, periph)

/* gpio28_uart1_cts */
#define GPIO28_UART1_CTS \
	BFLB_PINMUX(28, uart1, cts, periph)

/* gpio28_uart1_tx */
#define GPIO28_UART1_TX \
	BFLB_PINMUX(28, uart1, tx, periph)

/* gpio28_uart1_rx */
#define GPIO28_UART1_RX \
	BFLB_PINMUX(28, uart1, rx, periph)

/* gpio28_pwm_ch3 */
#define GPIO28_PWM_CH3 \
	BFLB_PINMUX(28, pwm, ch3, periph)

/* gpio28_cam_pix_dat4 */
#define GPIO28_CAM_PIX_DAT4 \
	BFLB_PINMUX(28, cam, pix_dat4, periph)

/* gpio28_jtag_tms */
#define GPIO28_JTAG_TMS \
	BFLB_PINMUX(28, jtag, tms, periph)

/* gpio28_fem_gpio3 */
#define GPIO28_FEM_GPIO3 \
	BFLB_PINMUX(28, fem, gpio3, periph)

/* gpio28_mii_rx_dv */
#define GPIO28_MII_RX_DV \
	BFLB_PINMUX(28, mii, rx_dv, periph)

/* gpio28_qdec0_b */
#define GPIO28_QDEC0_B \
	BFLB_PINMUX(28, qdec0, b, periph)

/* gpio29_clock_out1_i2s_ref */
#define GPIO29_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(29, clock_out1, i2s_ref, periph)

/* gpio29_clock_out1_aupll */
#define GPIO29_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(29, clock_out1, aupll, periph)

/* gpio29_clock_out1_xtal */
#define GPIO29_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(29, clock_out1, xtal, periph)

/* gpio29_i2s_fs */
#define GPIO29_I2S_FS \
	BFLB_PINMUX(29, i2s, fs, periph)

/* gpio29_spi_miso */
#define GPIO29_SPI_MISO \
	BFLB_PINMUX(29, spi, miso, periph)

/* gpio29_i2c_sda */
#define GPIO29_I2C_SDA \
	BFLB_PINMUX(29, i2c, sda, periph)

/* gpio29_uart0_rts */
#define GPIO29_UART0_RTS \
	BFLB_PINMUX(29, uart0, rts, periph)

/* gpio29_uart0_cts */
#define GPIO29_UART0_CTS \
	BFLB_PINMUX(29, uart0, cts, periph)

/* gpio29_uart0_tx */
#define GPIO29_UART0_TX \
	BFLB_PINMUX(29, uart0, tx, periph)

/* gpio29_uart0_rx */
#define GPIO29_UART0_RX \
	BFLB_PINMUX(29, uart0, rx, periph)

/* gpio29_uart1_rts */
#define GPIO29_UART1_RTS \
	BFLB_PINMUX(29, uart1, rts, periph)

/* gpio29_uart1_cts */
#define GPIO29_UART1_CTS \
	BFLB_PINMUX(29, uart1, cts, periph)

/* gpio29_uart1_tx */
#define GPIO29_UART1_TX \
	BFLB_PINMUX(29, uart1, tx, periph)

/* gpio29_uart1_rx */
#define GPIO29_UART1_RX \
	BFLB_PINMUX(29, uart1, rx, periph)

/* gpio29_pwm_ch4 */
#define GPIO29_PWM_CH4 \
	BFLB_PINMUX(29, pwm, ch4, periph)

/* gpio29_cam_pix_dat5 */
#define GPIO29_CAM_PIX_DAT5 \
	BFLB_PINMUX(29, cam, pix_dat5, periph)

/* gpio29_jtag_tdi */
#define GPIO29_JTAG_TDI \
	BFLB_PINMUX(29, jtag, tdi, periph)

/* gpio29_fem_gpio4 */
#define GPIO29_FEM_GPIO4 \
	BFLB_PINMUX(29, fem, gpio4, periph)

/* gpio29_qdec0_led */
#define GPIO29_QDEC0_LED \
	BFLB_PINMUX(29, qdec0, led, periph)

/* gpio30_clock_out0_i2s_ref */
#define GPIO30_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(30, clock_out0, i2s_ref, periph)

/* gpio30_clock_out0_aupll */
#define GPIO30_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(30, clock_out0, aupll, periph)

/* gpio30_clock_out0_xtal */
#define GPIO30_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(30, clock_out0, xtal, periph)

/* gpio30_i2s_do */
#define GPIO30_I2S_DO \
	BFLB_PINMUX(30, i2s, do, periph)

/* gpio30_spi_ss */
#define GPIO30_SPI_SS \
	BFLB_PINMUX(30, spi, ss, periph)

/* gpio30_i2c_scl */
#define GPIO30_I2C_SCL \
	BFLB_PINMUX(30, i2c, scl, periph)

/* gpio30_uart0_rts */
#define GPIO30_UART0_RTS \
	BFLB_PINMUX(30, uart0, rts, periph)

/* gpio30_uart0_cts */
#define GPIO30_UART0_CTS \
	BFLB_PINMUX(30, uart0, cts, periph)

/* gpio30_uart0_tx */
#define GPIO30_UART0_TX \
	BFLB_PINMUX(30, uart0, tx, periph)

/* gpio30_uart0_rx */
#define GPIO30_UART0_RX \
	BFLB_PINMUX(30, uart0, rx, periph)

/* gpio30_uart1_rts */
#define GPIO30_UART1_RTS \
	BFLB_PINMUX(30, uart1, rts, periph)

/* gpio30_uart1_cts */
#define GPIO30_UART1_CTS \
	BFLB_PINMUX(30, uart1, cts, periph)

/* gpio30_uart1_tx */
#define GPIO30_UART1_TX \
	BFLB_PINMUX(30, uart1, tx, periph)

/* gpio30_uart1_rx */
#define GPIO30_UART1_RX \
	BFLB_PINMUX(30, uart1, rx, periph)

/* gpio30_pwm_ch0 */
#define GPIO30_PWM_CH0 \
	BFLB_PINMUX(30, pwm, ch0, periph)

/* gpio30_jtag_tck */
#define GPIO30_JTAG_TCK \
	BFLB_PINMUX(30, jtag, tck, periph)

/* gpio30_fem_gpio0 */
#define GPIO30_FEM_GPIO0 \
	BFLB_PINMUX(30, fem, gpio0, periph)

/* gpio30_qdec1_a */
#define GPIO30_QDEC1_A \
	BFLB_PINMUX(30, qdec1, a, periph)

/* gpio31_clock_out1_i2s_ref */
#define GPIO31_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(31, clock_out1, i2s_ref, periph)

/* gpio31_clock_out1_aupll */
#define GPIO31_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(31, clock_out1, aupll, periph)

/* gpio31_clock_out1_xtal */
#define GPIO31_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(31, clock_out1, xtal, periph)

/* gpio31_i2s_di */
#define GPIO31_I2S_DI \
	BFLB_PINMUX(31, i2s, di, periph)

/* gpio31_spi_sclk */
#define GPIO31_SPI_SCLK \
	BFLB_PINMUX(31, spi, sclk, periph)

/* gpio31_i2c_sda */
#define GPIO31_I2C_SDA \
	BFLB_PINMUX(31, i2c, sda, periph)

/* gpio31_uart0_rts */
#define GPIO31_UART0_RTS \
	BFLB_PINMUX(31, uart0, rts, periph)

/* gpio31_uart0_cts */
#define GPIO31_UART0_CTS \
	BFLB_PINMUX(31, uart0, cts, periph)

/* gpio31_uart0_tx */
#define GPIO31_UART0_TX \
	BFLB_PINMUX(31, uart0, tx, periph)

/* gpio31_uart0_rx */
#define GPIO31_UART0_RX \
	BFLB_PINMUX(31, uart0, rx, periph)

/* gpio31_uart1_rts */
#define GPIO31_UART1_RTS \
	BFLB_PINMUX(31, uart1, rts, periph)

/* gpio31_uart1_cts */
#define GPIO31_UART1_CTS \
	BFLB_PINMUX(31, uart1, cts, periph)

/* gpio31_uart1_tx */
#define GPIO31_UART1_TX \
	BFLB_PINMUX(31, uart1, tx, periph)

/* gpio31_uart1_rx */
#define GPIO31_UART1_RX \
	BFLB_PINMUX(31, uart1, rx, periph)

/* gpio31_pwm_ch2 */
#define GPIO31_PWM_CH2 \
	BFLB_PINMUX(31, pwm, ch2, periph)

/* gpio31_cam_pix_dat7 */
#define GPIO31_CAM_PIX_DAT7 \
	BFLB_PINMUX(31, cam, pix_dat7, periph)

/* gpio31_jtag_tdo */
#define GPIO31_JTAG_TDO \
	BFLB_PINMUX(31, jtag, tdo, periph)

/* gpio31_fem_gpio1 */
#define GPIO31_FEM_GPIO1 \
	BFLB_PINMUX(31, fem, gpio1, periph)

/* gpio31_qdec1_b */
#define GPIO31_QDEC1_B \
	BFLB_PINMUX(31, qdec1, b, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL706X_PINCTRL_H_ */
